# -*- coding: utf-8 -*-
info = {
    "%%hundred": {
        "0": "ი;",
        "(1, 'inf')": "­=%spellout-cardinal=;"
    },
    "%%th": {
        "0": "ი;",
        "(1, 'inf')": "' =%spellout-cardinal=;"
    },
    "%spellout-cardinal": {
        "0": "ნული;",
        "1": "ერთი;",
        "2": "ორი;",
        "3": "სამი;",
        "4": "ოთხი;",
        "5": "ხუთი;",
        "6": "ექვსი;",
        "7": "შვიდი;",
        "8": "რვა;",
        "9": "ცხრა;",
        "10": "ათი;",
        "11": "თერთმეტი;",
        "12": "თორმეტი;",
        "13": "ცამეტი;",
        "14": "თოთხმეტი;",
        "15": "თხუთმეტი;",
        "16": "თექვსმეტი;",
        "17": "ჩვიდმეტი;",
        "18": "თრვამეტი;",
        "(19, 99)": "ცხრამეტი;",
        "(100, 199)": "ას>%%hundred>;",
        "(200, 299)": "ორას>%%hundred>;",
        "(300, 399)": "სამას>%%hundred>;",
        "(400, 499)": "ოთხას>%%hundred>;",
        "(500, 599)": "ხუთას>%%hundred>;",
        "(600, 699)": "ექვსას>%%hundred>;",
        "(700, 799)": "შვიდას>%%hundred>;",
        "(800, 899)": "რვაას>%%hundred>;",
        "(900, 999)": "ცხრაას>%%hundred>;",
        "(1000, 1999)": "ათას>%%th>;",
        "(2000, 999999)": "<< ათას>%%th>;",
        "(1000000, 999999999)": "<< მილიონ>%%th>;",
        "(1000000000, 999999999999)": "<< მილიარდ>%%th>;",
        "(1000000000000, 999999999999999)": "<< ბილიონ>%%th>;",
        "(1000000000000000, 999999999999999999)": "<< ბილიარდ>%%th>;",
        "(1000000000000000000, 'inf')": "=#,##0=;"
    },
    "%spellout-numbering": {
        "(0, 'inf')": "=%spellout-cardinal=;"
    },
    "%spellout-numbering-year": {
        "(0, 'inf')": "=%spellout-numbering=;"
    }
}