# -*- coding: utf-8 -*-
info = {
    "%%lenient-parse": {
        "(0, 'inf')": "&[last primary ignorable ] << ' ' << '​' << '­';"
    },
    "%spellout-cardinal": {
        "(0, 'inf')": "=%spellout-numbering=;"
    },
    "%spellout-numbering": {
        "0": "សូន្យ;",
        "1": "មួយ;",
        "2": "ពីរ;",
        "3": "បី;",
        "4": "បួន;",
        "5": "ប្រាំ;",
        "6": "ប្រាំមួយ;",
        "7": "ប្រាំពីរ;",
        "8": "ប្រាំបី;",
        "9": "ប្រាំបួន;",
        "(10, 19)": "ដប់[​>>];",
        "(20, 29)": "ម្ភៃ[​>>];",
        "(30, 39)": "សាមសិប[​>>];",
        "(40, 49)": "សែសិប[​>>];",
        "(50, 59)": "ហាសិប[​>>];",
        "(60, 69)": "ហុកសិប[​>>];",
        "(70, 79)": "ចិតសិប[​>>];",
        "(80, 89)": "ប៉ែតសិប[​>>];",
        "(90, 99)": "កៅសិប[​>>];",
        "(100, 999)": "<<​រយ[​>>];",
        "(1000, 9999)": "<<​ពាន់[​>>];",
        "(10000, 99999)": "<<​ម៉ឺន[​>>];",
        "(100000, 999999)": "<<​សែន[​>>];",
        "(1000000, 9999999999)": "<<​លាន[​>>];",
        "(10000000000, 999999999999)": "<<​ពាន់​កោដិ[​>>];",
        "(1000000000000, 'inf')": "=#,##0=;"
    },
    "%spellout-numbering-year": {
        "(0, 'inf')": "=%spellout-numbering=;"
    },
    "%spellout-ordinal": {
        "(0, 'inf')": "ទី=%spellout-cardinal=;"
    }
}