# -*- coding: utf-8 -*-
info = {
    "%%and": {
        "(0, 99)": "' жана =%spellout-cardinal-verbose=;",
        "(100, 'inf')": "' =%spellout-cardinal-verbose=;"
    },
    "%%commas": {
        "(0, 99)": "' жана =%spellout-cardinal-verbose=;",
        "(100, 999)": ", =%spellout-cardinal-verbose=;",
        "(1000, 999999)": ", <%spellout-cardinal-verbose< миң[>%%commas>];",
        "(1000000, 'inf')": ", =%spellout-cardinal-verbose=;"
    },
    "%%inci": {
        "0": "инчи;",
        "(1, 'inf')": "' =%spellout-ordinal=;"
    },
    "%%ingci": {
        "0": "иңчи;",
        "(1, 'inf')": "' =%spellout-ordinal=;"
    },
    "%%ncu": {
        "0": "нчы;",
        "(1, 'inf')": "' =%spellout-ordinal=;"
    },
    "%%ncy": {
        "0": "нчү;",
        "(1, 'inf')": "' =%spellout-ordinal=;"
    },
    "%%uncu": {
        "0": "ынчы;",
        "(1, 'inf')": "' =%spellout-ordinal=;"
    },
    "%%yncy": {
        "0": "унчу;",
        "(1, 'inf')": "' =%spellout-ordinal=;"
    },
    "%%yncy2": {
        "0": "үнчү;",
        "(1, 'inf')": "' =%spellout-ordinal=;"
    },
    "%%z-spellout-fraction": {
        "(10, 99)": "ондон <%spellout-numbering<;",
        "(100, 999)": "жүздөн <%spellout-numbering<;",
        "(1000, 9999)": "миңден <%spellout-numbering<;",
        "(10000, 99999)": "он миңден <%spellout-numbering<;",
        "(100000, 999999)": "жүз миңден <%spellout-numbering<;",
        "(1000000, 9999999)": "миллиондон <%spellout-numbering<;",
        "(10000000, 99999999)": "он миллиондон <%spellout-numbering<;",
        "(100000000, 999999999)": "жүз миллиондон <%spellout-numbering<;",
        "(1000000000, 9999999999)": "миллиарддан <%spellout-numbering<;",
        "(10000000000, 99999999999)": "он миллиарддан <%spellout-numbering<;",
        "(100000000000, 999999999999)": "жүз миллиарддан <%spellout-numbering<;",
        "(1000000000000, 'inf')": "0* <#,##0<<;"
    },
    "%spellout-cardinal": {
        "0": "нөл;",
        "1": "бир;",
        "2": "эки;",
        "3": "үч;",
        "4": "төрт;",
        "5": "беш;",
        "6": "алты;",
        "7": "жети;",
        "8": "сегиз;",
        "9": "тогуз;",
        "(10, 19)": "он[ >>];",
        "(20, 29)": "жыйырма[ >>];",
        "(30, 39)": "отуз[ >>];",
        "(40, 49)": "кырк[ >>];",
        "(50, 59)": "элүү[ >>];",
        "(60, 69)": "алтымыш[ >>];",
        "(70, 79)": "жетимиш[ >>];",
        "(80, 89)": "сексен[ >>];",
        "(90, 99)": "токсон[ >>];",
        "100": "жүз;",
        "(101, 199)": "<< жүз[ >>];",
        "(200, 999)": "<< жүз[ >>];",
        "1000": "миң;",
        "(1001, 1999)": "<< миң[ >>];",
        "(2000, 999999)": "<< миң[ >>];",
        "1000000": "миллион;",
        "(1000001, 1999999)": "<< миллион[ >>];",
        "(2000000, 999999999)": "<< миллион[ >>];",
        "1000000000": "миллиард;",
        "(1000000001, 1999999999)": "<< миллиард[ >>];",
        "(2000000000, 999999999999)": "<< миллиард[ >>];",
        "1000000000000": "триллион;",
        "(1000000000001, 1999999999999)": "<< триллион[ >>];",
        "(2000000000000, 999999999999999)": "<< триллион[ >>];",
        "1000000000000000": "квадриллион;",
        "(1000000000000001, 1999999999999999)": "<< квадриллион[ >>];",
        "(2000000000000000, 999999999999999999)": "<< квадриллион[ >>];",
        "(1000000000000000000, 'inf')": "=#,##0=;"
    },
    "%spellout-cardinal-verbose": {
        "(0, 99)": "=%spellout-cardinal=;",
        "100": "жүз;",
        "(101, 199)": "<< жүз[>%%and>];",
        "(200, 999)": "<< жүз[>%%and>];",
        "1000": "миң;",
        "(1001, 1999)": "<< миң[>%%and>];",
        "(2000, 99999)": "<< миң[>%%and>];",
        "(100000, 999999)": "<< миң[>%%commas>];",
        "1000000": "миллион;",
        "(1000001, 1999999)": "<< миллион[>%%commas>];",
        "(2000000, 999999999)": "<< миллион[>%%commas>];",
        "1000000000": "миллиард;",
        "(1000000001, 1999999999)": "<< миллиард[>%%commas>];",
        "(2000000000, 999999999999)": "<< миллиард[>%%commas>];",
        "1000000000000": "триллион;",
        "(1000000000001, 1999999999999)": "<< триллион[>%%commas>];",
        "(2000000000000, 999999999999999)": "<< триллион[>%%commas>];",
        "1000000000000000": "квадриллион;",
        "(1000000000000001, 1999999999999999)": "<< квадриллион[>%%commas>];",
        "(2000000000000000, 999999999999999999)": "<< квадриллион[>%%commas>];",
        "(1000000000000000000, 'inf')": "=#,##0=;"
    },
    "%spellout-numbering": {
        "(0, 'inf')": "=%spellout-cardinal=;"
    },
    "%spellout-numbering-year": {
        "(0, 'inf')": "=%spellout-numbering=;"
    },
    "%spellout-ordinal": {
        "0": "нөлүнчү;",
        "1": "биринчи;",
        "2": "экинчи;",
        "3": "үчүнчү;",
        "4": "төртүнчү;",
        "5": "бешинчи;",
        "6": "алтынчы;",
        "7": "жетинчи;",
        "8": "сегизинчи;",
        "9": "тогузунчу;",
        "(10, 19)": "он>%%yncy>;",
        "(20, 29)": "жыйырма>%%ncu>;",
        "(30, 39)": "отуз>%%yncy>;",
        "(40, 49)": "кырк>%%uncu>;",
        "(50, 59)": "элүү>%%ncy>;",
        "(60, 69)": "алтымыш>%%uncu>;",
        "(70, 79)": "жетимиш>%%inci>;",
        "(80, 89)": "сексен>%%inci>;",
        "(90, 99)": "токсон>%%yncy>;",
        "100": "жүзүнчү;",
        "(101, 199)": "<%spellout-numbering< жүз>%%yncy2>;",
        "(200, 999)": "<%spellout-numbering< жүз>%%yncy2>;",
        "1000": "миңиңчи;",
        "(1001, 1999)": "<%spellout-numbering< миң>%%ingci>;",
        "(2000, 999999)": "<%spellout-numbering< миң>%%ingci>;",
        "1000000": "миллионунчу;",
        "(1000001, 1999999)": "<%spellout-numbering< миллион>%%yncy>;",
        "(2000000, 999999999)": "<%spellout-numbering< миллион>%%yncy>;",
        "1000000000": "миллиардынчы;",
        "(1000000001, 1999999999)": "<%spellout-numbering< миллиард>%%uncu>;",
        "(2000000000, 999999999999)": "<%spellout-numbering< миллиард>%%uncu>;",
        "1000000000000": "триллионунчу;",
        "(1000000000001, 1999999999999)": "<%spellout-numbering< триллион>%%yncy>;",
        "(2000000000000, 999999999999999)": "<%spellout-numbering< триллион>%%yncy>;",
        "1000000000000000": "квадриллионунчу;",
        "(1000000000000001, 1999999999999999)": "<%spellout-numbering< квадриллион>%%yncy>;",
        "(2000000000000000, 999999999999999999)": "<%spellout-numbering< квадриллион>%%yncy>;",
        "(1000000000000000000, 'inf')": "=#,##0='inci;"
    }
}