# -*- coding: utf-8 -*-
info = {
    "%%alt-ones": {
        "1": "ເອັດ;",
        "(2, 'inf')": "=%spellout-cardinal=;"
    },
    "%spellout-cardinal": {
        "0": "ศูนย์;",
        "1": "ໜຶ່ງ;",
        "2": "ສອງ;",
        "3": "ສາມ;",
        "4": "ສີ່;",
        "5": "ຫ້າ;",
        "6": "ຫົກ;",
        "7": "ເຈັດ;",
        "8": "ແປດ;",
        "9": "ເກົ້າ;",
        "(10, 19)": "ສິບ[​>%%alt-ones>];",
        "(20, 29)": "ຊາວ[​>%%alt-ones>];",
        "(30, 99)": "<<​ສິບ[​>%%alt-ones>];",
        "(100, 999)": "<<​ร้อย[​>>];",
        "(1000, 9999)": "<<​พัน[​>>];",
        "(10000, 99999)": "<<​หมื่น[​>>];",
        "(100000, 999999)": "<<​แสน[​>>];",
        "(1000000, 999999999999999999)": "<<​ล้าน[​>>];",
        "(1000000000000000000, 'inf')": "=#,##0=;"
    },
    "%spellout-numbering": {
        "(0, 'inf')": "=%spellout-cardinal=;"
    },
    "%spellout-numbering-year": {
        "(0, 'inf')": "=%spellout-numbering=;"
    },
    "%spellout-ordinal": {
        "(0, 'inf')": "ที่​=%spellout-cardinal=;"
    }
}