# -*- coding: utf-8 -*-
info = {
    "%spellout-cardinal": {
        "0": "သုည;",
        "1": "တစ်;",
        "2": "နှစ်;",
        "3": "သုံး;",
        "4": "လေး;",
        "5": "ငါး;",
        "6": "ခြောက်;",
        "7": "ခုနှစ်;",
        "8": "ရှစ်;",
        "9": "ကိုး;",
        "10": "ဆယ်;",
        "(11, 19)": "ဆယ့်[>>];",
        "(20, 99)": "<<ဆယ်[>>];",
        "100": "<<ရာ;",
        "(101, 999)": "<<ရာ့[>>];",
        "1000": "<<ထောင်;",
        "(1001, 9999)": "<<ထောင့်[>>];",
        "(10000, 99999)": "<<သောင်း[>>];",
        "(100000, 999999)": "<<သိန်း[>>];",
        "(1000000, 9999999)": "<<သန်း[>>];",
        "(10000000, 99999999999999)": "<<ကုဋေ[>>];",
        "(100000000000000, 999999999999999999)": "<<ကောဋိ[>>];",
        "(1000000000000000000, 'inf')": "=#,##0=;"
    },
    "%spellout-numbering": {
        "(0, 'inf')": "=%spellout-cardinal=;"
    },
    "%spellout-numbering-year": {
        "(0, 'inf')": "=%spellout-cardinal=;"
    },
    "%spellout-ordinal": {
        "0": "=%spellout-cardinal=;",
        "1": "ပထမ;",
        "2": "ဒုတိယ;",
        "3": "တတိယ;",
        "4": "စတုတ္ထ;",
        "5": "ပဉ္စမ;",
        "6": "ဆဋ္ဌမ;",
        "7": "သတ္တမ;",
        "8": "အဋ္ဌမ;",
        "9": "နဝမ;",
        "10": "ဒသမ;",
        "(11, 'inf')": "=%spellout-cardinal=;"
    }
}