# -*- coding: utf-8 -*-
info = {
    "%%alt-ones": {
        "1": "เอ็ด;",
        "(2, 'inf')": "=%spellout-cardinal=;"
    },
    "%spellout-cardinal": {
        "0": "ศูนย์;",
        "1": "หนึ่ง;",
        "2": "สอง;",
        "3": "สาม;",
        "4": "สี่;",
        "5": "ห้า;",
        "6": "หก;",
        "7": "เจ็ด;",
        "8": "แปด;",
        "9": "เก้า;",
        "(10, 19)": "สิบ[​>%%alt-ones>];",
        "(20, 29)": "ยี่​สิบ[​>%%alt-ones>];",
        "(30, 99)": "<<​สิบ[​>%%alt-ones>];",
        "(100, 999)": "<<​ร้อย[​>>];",
        "(1000, 9999)": "<<​พัน[​>>];",
        "(10000, 99999)": "<<​หมื่น[​>>];",
        "(100000, 999999)": "<<​แสน[​>>];",
        "(1000000, 999999999999999999)": "<<​ล้าน[​>>];",
        "(1000000000000000000, 'inf')": "=#,##0=;"
    },
    "%spellout-numbering": {
        "(0, 'inf')": "=%spellout-cardinal=;"
    },
    "%spellout-numbering-year": {
        "(0, 'inf')": "=%spellout-numbering=;"
    },
    "%spellout-ordinal": {
        "(0, 'inf')": "ที่​=%spellout-cardinal=;"
    }
}