# -*- coding: utf-8 -*-
info = {
    "name": "be",
    "date_order": "DMY",
    "january": [
        "студзень",
        "сту",
        "студзеня",
        "Стд"
    ],
    "february": [
        "люты",
        "лют",
        "лютага"
    ],
    "march": [
        "сакавік",
        "сак",
        "сакавіка"
    ],
    "april": [
        "красавік",
        "кра",
        "красавіка",
        "Крс"
    ],
    "may": [
        "май",
        "мая",
        "Траўня",
        "Тра"
    ],
    "june": [
        "чэрвень",
        "чэр",
        "чэрвеня"
    ],
    "july": [
        "ліпень",
        "ліп",
        "ліпеня"
    ],
    "august": [
        "жнівень",
        "жні",
        "жніўня",
        "Жнівеня",
        "Жнв"
    ],
    "september": [
        "верасень",
        "вер",
        "верасня",
        "Врс"
    ],
    "october": [
        "кастрычнік",
        "кас",
        "кастрычніка",
        "Кст"
    ],
    "november": [
        "лістапад",
        "ліс",
        "лістапада",
        "Ліс"
    ],
    "december": [
        "снежань",
        "сне",
        "снежня",
        "Снж"
    ],
    "monday": [
        "панядзелак",
        "пн",
        "Пнд"
    ],
    "tuesday": [
        "аўторак",
        "аў",
        "Аўт"
    ],
    "wednesday": [
        "серада",
        "ср"
    ],
    "thursday": [
        "чацвер",
        "чц",
        "Чцв",
        "Чв"
    ],
    "friday": [
        "пятніца",
        "пт",
        "Пят"
    ],
    "saturday": [
        "субота",
        "сб",
        "Суб"
    ],
    "sunday": [
        "нядзеля",
        "нд",
        "Няд"
    ],
    "am": [
        "am"
    ],
    "pm": [
        "pm"
    ],
    "year": [
        "год",
        "г",
        "гады",
        "года",
        "гадоў"
    ],
    "month": [
        "месяц",
        "мес",
        "месяца",
        "месяцы",
        "месяцаў"
    ],
    "week": [
        "тыд",
        "тыдзень",
        "тыдня",
        "тыдні",
        "тыдняў"
    ],
    "day": [
        "дзень",
        "д",
        "дні",
        "дзён",
        "дзен"
    ],
    "hour": [
        "гадзіна",
        "гадз",
        "гадзіны",
        "гадзіну",
        "гадзін"
    ],
    "minute": [
        "хвіліна",
        "хв",
        "хвілін",
        "хвіліны",
        "хвіліну",
        "хвіл"
    ],
    "second": [
        "секунда",
        "с",
        "секунды",
        "секунду",
        "секунд",
        "сек"
    ],
    "relative-type": {
        "1 year ago": [
            "у мінулым годзе"
        ],
        "0 year ago": [
            "у гэтым годзе"
        ],
        "in 1 year": [
            "у наступным годзе"
        ],
        "1 month ago": [
            "у мінулым месяцы"
        ],
        "0 month ago": [
            "у гэтым месяцы"
        ],
        "in 1 month": [
            "у наступным месяцы"
        ],
        "1 week ago": [
            "на мінулым тыдні"
        ],
        "0 week ago": [
            "на гэтым тыдні"
        ],
        "in 1 week": [
            "на наступным тыдні"
        ],
        "1 day ago": [
            "учора",
            "ўчора"
        ],
        "0 day ago": [
            "сёння",
            "сення"
        ],
        "in 1 day": [
            "заўтра"
        ],
        "0 hour ago": [
            "у гэту гадзіну"
        ],
        "0 minute ago": [
            "у гэту хвіліну"
        ],
        "0 second ago": [
            "цяпер"
        ],
        "2 day ago": [
            "пазаўчора"
        ]
    },
    "relative-type-regex": {
        "in \\1 year": [
            "праз (\\d+) год",
            "праз (\\d+) года",
            "праз (\\d+) г"
        ],
        "\\1 year ago": [
            "(\\d+) год таму",
            "(\\d+) года таму",
            "(\\d+) г таму"
        ],
        "in \\1 month": [
            "праз (\\d+) месяц",
            "праз (\\d+) месяца",
            "праз (\\d+) мес"
        ],
        "\\1 month ago": [
            "(\\d+) месяц таму",
            "(\\d+) месяца таму",
            "(\\d+) мес таму"
        ],
        "in \\1 week": [
            "праз (\\d+) тыдзень",
            "праз (\\d+) тыдня",
            "праз (\\d+) тыд"
        ],
        "\\1 week ago": [
            "(\\d+) тыдзень таму",
            "(\\d+) тыдня таму",
            "(\\d+) тыд таму"
        ],
        "in \\1 day": [
            "праз (\\d+) дзень",
            "праз (\\d+) дня",
            "праз (\\d+) д"
        ],
        "\\1 day ago": [
            "(\\d+) дзень таму",
            "(\\d+) дня таму",
            "(\\d+) д таму"
        ],
        "in \\1 hour": [
            "праз (\\d+) гадзіну",
            "праз (\\d+) гадзіны",
            "праз (\\d+) гадз"
        ],
        "\\1 hour ago": [
            "(\\d+) гадзіну таму",
            "(\\d+) гадзіны таму",
            "(\\d+) гадз таму"
        ],
        "in \\1 minute": [
            "праз (\\d+) хвіліну",
            "праз (\\d+) хвіліны",
            "праз (\\d+) хв"
        ],
        "\\1 minute ago": [
            "(\\d+) хвіліну таму",
            "(\\d+) хвіліны таму",
            "(\\d+) хв таму"
        ],
        "in \\1 second": [
            "праз (\\d+) секунду",
            "праз (\\d+) секунды",
            "праз (\\d+) с"
        ],
        "\\1 second ago": [
            "(\\d+) секунду таму",
            "(\\d+) секунды таму",
            "(\\d+) с таму"
        ]
    },
    "locale_specific": {},
    "skip": [
        "каля",
        "у",
        "ў",
        "і",
        " ",
        ".",
        ",",
        ";",
        "-",
        "/",
        "'",
        "|",
        "@",
        "[",
        "]",
        "，"
    ],
    "sentence_splitter_group": 1,
    "ago": [
        "таму назад",
        "таму",
        "назад"
    ],
    "in": [
        "на працягу"
    ],
    "simplifications": [
        {
            "^гадзіна": "1 гадзіна"
        },
        {
            "гадзіну": "1 гадзіну"
        },
        {
            "^хвіліну": "1 хвіліну"
        },
        {
            "^секунду": "1 секунду"
        },
        {
            "некалькі секунд": "44 секунды"
        },
        {
            "некалькі хвілін": "2 хвіліны"
        },
        {
            "(\\d+)\\s*гадзін\\s(\\d+)\\s*хвілін": "\\1:\\2"
        }
    ]
}