# -*- coding: utf-8 -*-
info = {
    "name": "gu",
    "date_order": "DMY",
    "january": [
        "જાન્યુઆરી",
        "જાન્યુ"
    ],
    "february": [
        "ફેબ્રુઆરી",
        "ફેબ્રુ"
    ],
    "march": [
        "માર્ચ"
    ],
    "april": [
        "એપ્રિલ"
    ],
    "may": [
        "મે"
    ],
    "june": [
        "જૂન"
    ],
    "july": [
        "જુલાઈ"
    ],
    "august": [
        "ઑગસ્ટ"
    ],
    "september": [
        "સપ્ટેમ્બર",
        "સપ્ટે"
    ],
    "october": [
        "ઑક્ટોબર",
        "ઑક્ટો"
    ],
    "november": [
        "નવેમ્બર",
        "નવે"
    ],
    "december": [
        "ડિસેમ્બર",
        "ડિસે"
    ],
    "monday": [
        "સોમવાર",
        "સોમ"
    ],
    "tuesday": [
        "મંગળવાર",
        "મંગળ"
    ],
    "wednesday": [
        "બુધવાર",
        "બુધ"
    ],
    "thursday": [
        "ગુરુવાર",
        "ગુરુ"
    ],
    "friday": [
        "શુક્રવાર",
        "શુક્ર"
    ],
    "saturday": [
        "શનિવાર",
        "શનિ"
    ],
    "sunday": [
        "રવિવાર",
        "રવિ"
    ],
    "am": [
        "am"
    ],
    "pm": [
        "pm"
    ],
    "year": [
        "વર્ષ",
        "વ"
    ],
    "month": [
        "મહિનો",
        "મ"
    ],
    "week": [
        "અઠવાડિયું",
        "અઠ"
    ],
    "day": [
        "દિવસ"
    ],
    "hour": [
        "કલાક",
        "ક"
    ],
    "minute": [
        "મિનિટ",
        "મિ"
    ],
    "second": [
        "સેકન્ડ",
        "સે"
    ],
    "relative-type": {
        "1 year ago": [
            "ગયા વર્ષે"
        ],
        "0 year ago": [
            "આ વર્ષે"
        ],
        "in 1 year": [
            "આવતા વર્ષે"
        ],
        "1 month ago": [
            "ગયા મહિને"
        ],
        "0 month ago": [
            "આ મહિને"
        ],
        "in 1 month": [
            "આવતા મહિને"
        ],
        "1 week ago": [
            "ગયા અઠવાડિયે"
        ],
        "0 week ago": [
            "આ અઠવાડિયે"
        ],
        "in 1 week": [
            "આવતા અઠવાડિયે"
        ],
        "1 day ago": [
            "ગઈકાલે"
        ],
        "0 day ago": [
            "આજે"
        ],
        "in 1 day": [
            "આવતીકાલે"
        ],
        "0 hour ago": [
            "આ કલાક"
        ],
        "0 minute ago": [
            "આ મિનિટ"
        ],
        "0 second ago": [
            "હમણાં"
        ]
    },
    "relative-type-regex": {
        "in \\1 year": [
            "(\\d+) વર્ષમાં"
        ],
        "\\1 year ago": [
            "(\\d+) વર્ષ પહેલાં",
            "(\\d+) વર્ષ પહેલા"
        ],
        "in \\1 month": [
            "(\\d+) મહિનામાં"
        ],
        "\\1 month ago": [
            "(\\d+) મહિના પહેલાં"
        ],
        "in \\1 week": [
            "(\\d+) અઠવાડિયામાં",
            "(\\d+) અઠ માં"
        ],
        "\\1 week ago": [
            "(\\d+) અઠવાડિયા પહેલાં",
            "(\\d+) અઠ પહેલાં"
        ],
        "in \\1 day": [
            "(\\d+) દિવસમાં"
        ],
        "\\1 day ago": [
            "(\\d+) દિવસ પહેલાં"
        ],
        "in \\1 hour": [
            "(\\d+) કલાકમાં"
        ],
        "\\1 hour ago": [
            "(\\d+) કલાક પહેલાં"
        ],
        "in \\1 minute": [
            "(\\d+) મિનિટમાં"
        ],
        "\\1 minute ago": [
            "(\\d+) મિનિટ પહેલાં"
        ],
        "in \\1 second": [
            "(\\d+) સેકંડમાં"
        ],
        "\\1 second ago": [
            "(\\d+) સેકંડ પહેલાં"
        ]
    },
    "locale_specific": {},
    "skip": [
        " ",
        ".",
        ",",
        ";",
        "-",
        "/",
        "'",
        "|",
        "@",
        "[",
        "]",
        "，"
    ]
}