# -*- coding: utf-8 -*-
info = {
    "name": "my",
    "date_order": "DMY",
    "january": [
        "ဇန်နဝါရီ",
        "ဇန်"
    ],
    "february": [
        "ဖေဖော်ဝါရီ",
        "ဖေ"
    ],
    "march": [
        "မတ်"
    ],
    "april": [
        "ဧပြီ",
        "ဧ"
    ],
    "may": [
        "မေ"
    ],
    "june": [
        "ဇွန်"
    ],
    "july": [
        "ဇူလိုင်",
        "ဇူ"
    ],
    "august": [
        "ဩဂုတ်",
        "ဩ"
    ],
    "september": [
        "စက်တင်ဘာ",
        "စက်"
    ],
    "october": [
        "အောက်တိုဘာ",
        "အောက်"
    ],
    "november": [
        "နိုဝင်ဘာ",
        "နို"
    ],
    "december": [
        "ဒီဇင်ဘာ",
        "ဒီ"
    ],
    "monday": [
        "တနင်္လာ"
    ],
    "tuesday": [
        "အင်္ဂါ"
    ],
    "wednesday": [
        "ဗုဒ္ဓဟူး"
    ],
    "thursday": [
        "ကြာသပတေး"
    ],
    "friday": [
        "သောကြာ"
    ],
    "saturday": [
        "စနေ"
    ],
    "sunday": [
        "တနင်္ဂနွေ"
    ],
    "am": [
        "နံနက်"
    ],
    "pm": [
        "ညနေ"
    ],
    "year": [
        "နှစ်"
    ],
    "month": [
        "လ"
    ],
    "week": [
        "ပတ်"
    ],
    "day": [
        "ရက်"
    ],
    "hour": [
        "နာရီ"
    ],
    "minute": [
        "မိနစ်"
    ],
    "second": [
        "စက္ကန့်"
    ],
    "relative-type": {
        "1 year ago": [
            "ယမန်နှစ်"
        ],
        "0 year ago": [
            "ယခုနှစ်"
        ],
        "in 1 year": [
            "လာမည့်နှစ်"
        ],
        "1 month ago": [
            "ပြီးခဲ့သည့်လ"
        ],
        "0 month ago": [
            "ယခုလ"
        ],
        "in 1 month": [
            "လာမည့်လ"
        ],
        "1 week ago": [
            "ပြီးခဲ့သည့် သီတင်းပတ်"
        ],
        "0 week ago": [
            "ယခု သီတင်းပတ်"
        ],
        "in 1 week": [
            "လာမည့် သီတင်းပတ်"
        ],
        "1 day ago": [
            "မနေ့က"
        ],
        "0 day ago": [
            "ယနေ့"
        ],
        "in 1 day": [
            "မနက်ဖြန်"
        ],
        "0 hour ago": [
            "ဤအချိန်"
        ],
        "0 minute ago": [
            "ဤမိနစ်"
        ],
        "0 second ago": [
            "ယခု"
        ]
    },
    "relative-type-regex": {
        "in \\1 year": [
            "(\\d+) နှစ်အတွင်း"
        ],
        "\\1 year ago": [
            "ပြီးခဲ့သည့် (\\d+) နှစ်"
        ],
        "in \\1 month": [
            "(\\d+) လအတွင်း"
        ],
        "\\1 month ago": [
            "ပြီးခဲ့သည့် (\\d+) လ"
        ],
        "in \\1 week": [
            "(\\d+) ပတ်အတွင်း"
        ],
        "\\1 week ago": [
            "ပြီးခဲ့သည့် (\\d+) ပတ်"
        ],
        "in \\1 day": [
            "(\\d+) ရက်အတွင်း"
        ],
        "\\1 day ago": [
            "ပြီးခဲ့သည့် (\\d+) ရက်"
        ],
        "in \\1 hour": [
            "(\\d+) နာရီအတွင်း"
        ],
        "\\1 hour ago": [
            "ပြီးခဲ့သည့် (\\d+) နာရီ"
        ],
        "in \\1 minute": [
            "(\\d+) မိနစ်အတွင်း"
        ],
        "\\1 minute ago": [
            "ပြီးခဲ့သည့် (\\d+) မိနစ်"
        ],
        "in \\1 second": [
            "(\\d+) စက္ကန့်အတွင်း"
        ],
        "\\1 second ago": [
            "ပြီးခဲ့သည့် (\\d+) စက္ကန့်"
        ]
    },
    "locale_specific": {},
    "skip": [
        " ",
        ".",
        ",",
        ";",
        "-",
        "/",
        "'",
        "|",
        "@",
        "[",
        "]",
        "，"
    ]
}