# -*- coding: utf-8 -*-
info = {
    "name": "sah",
    "date_order": "YMD",
    "january": [
        "тохсунньу",
        "тохс"
    ],
    "february": [
        "олунньу",
        "олун"
    ],
    "march": [
        "кулун тутар",
        "клн"
    ],
    "april": [
        "муус устар",
        "мсу"
    ],
    "may": [
        "ыам ыйа",
        "ыам",
        "ыам ыйын"
    ],
    "june": [
        "бэс ыйа",
        "бэс",
        "бэс ыйын"
    ],
    "july": [
        "от ыйа",
        "отй",
        "от ыйын"
    ],
    "august": [
        "атырдьых ыйа",
        "атр",
        "атырдьых ыйын"
    ],
    "september": [
        "балаҕан ыйа",
        "блҕ",
        "балаҕан ыйын"
    ],
    "october": [
        "алтынньы",
        "алт"
    ],
    "november": [
        "сэтинньи",
        "сэт"
    ],
    "december": [
        "ахсынньы",
        "ахс"
    ],
    "monday": [
        "бэнидиэнньик",
        "бн"
    ],
    "tuesday": [
        "оптуорунньук",
        "оп"
    ],
    "wednesday": [
        "сэрэдэ",
        "сэ"
    ],
    "thursday": [
        "чэппиэр",
        "чп"
    ],
    "friday": [
        "бээтиҥсэ",
        "бэ"
    ],
    "saturday": [
        "субуота",
        "сб"
    ],
    "sunday": [
        "баскыһыанньа",
        "бс"
    ],
    "am": [
        "эи"
    ],
    "pm": [
        "эк"
    ],
    "year": [
        "сыл"
    ],
    "month": [
        "ый"
    ],
    "week": [
        "нэдиэлэ"
    ],
    "day": [
        "күн"
    ],
    "hour": [
        "чаас"
    ],
    "minute": [
        "мүнүүтэ"
    ],
    "second": [
        "сөкүүндэ"
    ],
    "relative-type": {
        "1 year ago": [
            "былырыын"
        ],
        "0 year ago": [
            "быйыл"
        ],
        "in 1 year": [
            "эһиил"
        ],
        "1 month ago": [
            "ааспыт ый"
        ],
        "0 month ago": [
            "бу ый"
        ],
        "in 1 month": [
            "аныгыскы ый"
        ],
        "1 week ago": [
            "ааспыт нэдиэлэ"
        ],
        "0 week ago": [
            "бу нэдиэлэ"
        ],
        "in 1 week": [
            "кэлэр нэдиэлэ"
        ],
        "1 day ago": [
            "бэҕэһээ"
        ],
        "0 day ago": [
            "бүгүн"
        ],
        "in 1 day": [
            "сарсын"
        ],
        "0 hour ago": [
            "this hour"
        ],
        "0 minute ago": [
            "this minute"
        ],
        "0 second ago": [
            "билигин"
        ]
    },
    "relative-type-regex": {
        "in \\1 year": [
            "(\\d+) сылынан"
        ],
        "\\1 year ago": [
            "(\\d+) сыл ынараа өттүгэр"
        ],
        "in \\1 month": [
            "(\\d+) ыйынан"
        ],
        "\\1 month ago": [
            "(\\d+) ый ынараа өттүгэр"
        ],
        "in \\1 week": [
            "(\\d+) нэдиэлэннэн"
        ],
        "\\1 week ago": [
            "(\\d+) нэдиэлэ анараа өттүгэр"
        ],
        "in \\1 day": [
            "(\\d+) күнүнэн"
        ],
        "\\1 day ago": [
            "(\\d+) күн ынараа өттүгэр"
        ],
        "in \\1 hour": [
            "(\\d+) чааһынан"
        ],
        "\\1 hour ago": [
            "(\\d+) чаас ынараа өттүгэр"
        ],
        "in \\1 minute": [
            "(\\d+) мүнүүтэннэн"
        ],
        "\\1 minute ago": [
            "(\\d+) мүнүүтэ ынараа өттүгэр"
        ],
        "in \\1 second": [
            "(\\d+) сөкүүндэннэн"
        ],
        "\\1 second ago": [
            "(\\d+) сөкүүндэ ынараа өттүгэр",
            "(\\d+) сөк анараа өттүгэр"
        ]
    },
    "locale_specific": {},
    "skip": [
        " ",
        ".",
        ",",
        ";",
        "-",
        "/",
        "'",
        "|",
        "@",
        "[",
        "]",
        "，"
    ]
}