# -*- coding: utf-8 -*-
info = {
    "name": "ug",
    "date_order": "YMD",
    "january": [
        "يانۋار"
    ],
    "february": [
        "فېۋرال"
    ],
    "march": [
        "مارت"
    ],
    "april": [
        "ئاپرېل"
    ],
    "may": [
        "ماي"
    ],
    "june": [
        "ئىيۇن"
    ],
    "july": [
        "ئىيۇل"
    ],
    "august": [
        "ئاۋغۇست"
    ],
    "september": [
        "سېنتەبىر"
    ],
    "october": [
        "ئۆكتەبىر"
    ],
    "november": [
        "نويابىر"
    ],
    "december": [
        "دېكابىر"
    ],
    "monday": [
        "دۈشەنبە",
        "دۈ"
    ],
    "tuesday": [
        "سەيشەنبە",
        "سە"
    ],
    "wednesday": [
        "چارشەنبە",
        "چا"
    ],
    "thursday": [
        "پەيشەنبە",
        "پە"
    ],
    "friday": [
        "جۈمە",
        "جۈ"
    ],
    "saturday": [
        "شەنبە",
        "شە"
    ],
    "sunday": [
        "يەكشەنبە",
        "يە"
    ],
    "am": [
        "چب",
        "چۈشتىن بۇرۇن"
    ],
    "pm": [
        "چك",
        "چۈشتىن كېيىن"
    ],
    "year": [
        "يىل"
    ],
    "month": [
        "ئاي"
    ],
    "week": [
        "ھەپتە"
    ],
    "day": [
        "كۈن"
    ],
    "hour": [
        "سائەت"
    ],
    "minute": [
        "مىنۇت"
    ],
    "second": [
        "سېكۇنت"
    ],
    "relative-type": {
        "1 year ago": [
            "ئۆتكەن يىل"
        ],
        "0 year ago": [
            "بۇ يىل"
        ],
        "in 1 year": [
            "كېلەر يىل"
        ],
        "1 month ago": [
            "ئۆتكەن ئاي"
        ],
        "0 month ago": [
            "بۇ ئاي"
        ],
        "in 1 month": [
            "كېلەر ئاي"
        ],
        "1 week ago": [
            "ئۆتكەن ھەپتە"
        ],
        "0 week ago": [
            "بۇ ھەپتە"
        ],
        "in 1 week": [
            "كېلەر ھەپتە"
        ],
        "1 day ago": [
            "تۈنۈگۈن"
        ],
        "0 day ago": [
            "بۈگۈن"
        ],
        "in 1 day": [
            "ئەتە"
        ],
        "0 hour ago": [
            "this hour"
        ],
        "0 minute ago": [
            "this minute"
        ],
        "0 second ago": [
            "now"
        ]
    },
    "relative-type-regex": {
        "in \\1 year": [
            "(\\d+) يىلدىن كېيىن"
        ],
        "\\1 year ago": [
            "(\\d+) يىل ئىلگىرى"
        ],
        "in \\1 month": [
            "(\\d+) ئايدىن كېيىن"
        ],
        "\\1 month ago": [
            "(\\d+) ئاي ئىلگىرى"
        ],
        "in \\1 week": [
            "(\\d+) ھەپتىدىن كېيىن"
        ],
        "\\1 week ago": [
            "(\\d+) ھەپتە ئىلگىرى"
        ],
        "in \\1 day": [
            "(\\d+) كۈندىن كېيىن"
        ],
        "\\1 day ago": [
            "(\\d+) كۈن ئىلگىرى"
        ],
        "in \\1 hour": [
            "(\\d+) سائەتتىن كېيىن"
        ],
        "\\1 hour ago": [
            "(\\d+) سائەت ئىلگىرى"
        ],
        "in \\1 minute": [
            "(\\d+) مىنۇتتىن كېيىن"
        ],
        "\\1 minute ago": [
            "(\\d+) مىنۇت ئىلگىرى"
        ],
        "in \\1 second": [
            "(\\d+) سېكۇنتتىن كېيىن"
        ],
        "\\1 second ago": [
            "(\\d+) سېكۇنت ئىلگىرى"
        ]
    },
    "locale_specific": {},
    "skip": [
        " ",
        ".",
        ",",
        ";",
        "-",
        "/",
        "'",
        "|",
        "@",
        "[",
        "]",
        "，"
    ]
}